# EditRenderWorksPrefs

## Description
Allows the user to edit RenderWorks renderer preferences and stores them in the current drawing.

```pascal
PROCEDURE EditRenderWorksPrefs(VAR updateRendering : BOOLEAN);
```

```python

def vs.EditRenderWorksPrefs():
    return updateRendering
```

## Parameters
|Name|Type|Description|
|---|---|---|
|updateRendering|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* View / Zoom